In [1]:
import pandas as pd

In [2]:
df=pd.read_csv('D:\\Paython\\Book1.csv')
df

        date  abc  name   roll   id    med  customer
0   1/9/2022  yes  asim   13.0  1.0  123.0        34
1   1/2/2019  yes  zain  143.0  2.0  345.0        23
2   4/6/2019   no   NaN    NaN  3.0    NaN         2
3  4/11/2022  yes   NaN    NaN  NaN  345.0         3
4  2/10/2021   no  zaib  156.0  NaN  987.0        45
5   6/3/2022  yes  asif    NaN  NaN    NaN         6
6   2/4/2022  NaN   NaN   12.0  7.0    NaN         7

In [3]:
df.isnull()

    date    abc   name   roll     id    med  customer
0  False  False  False  False  False  False     False
1  False  False  False  False  False  False     False
2  False  False   True   True  False   True     False
3  False  False   True   True   True  False     False
4  False  False  False  False   True  False     False
5  False  False  False   True   True   True     False
6  False   True   True  False  False   True     False

In [4]:
df.isnull().sum()

date        0
abc         1
name        3
roll        3
id          3
med         3
customer    0
dtype: int64

In [5]:
df.isnull().sum().sum()

13

In [6]:
df=pd.read_csv('D:\\Paython\\Book1.csv')
df

        date  abc  name   roll   id    med  customer
0   1/9/2022  yes  asim   13.0  1.0  123.0        34
1   1/2/2019  yes  zain  143.0  2.0  345.0        23
2   4/6/2019   no   NaN    NaN  3.0    NaN         2
3  4/11/2022  yes   NaN    NaN  NaN  345.0         3
4  2/10/2021   no  zaib  156.0  NaN  987.0        45
5   6/3/2022  yes  asif    NaN  NaN    NaN         6
6   2/4/2022  NaN   NaN   12.0  7.0    NaN         7

In [7]:
df.notnull()

   date    abc   name   roll     id    med  customer
0  True   True   True   True   True   True      True
1  True   True   True   True   True   True      True
2  True   True  False  False   True  False      True
3  True   True  False  False  False   True      True
4  True   True   True   True  False   True      True
5  True   True   True  False  False  False      True
6  True  False  False   True   True  False      True

In [8]:
df.notnull().sum()

date        7
abc         6
name        4
roll        4
id          4
med         4
customer    7
dtype: int64

In [9]:
df.notnull().sum().sum()

36

In [13]:
import numpy as np
sr=pd.Series([1,2,3,'null',np.nan])
sr

0       1
1       2
2       3
3    null
4     NaN
dtype: object

In [22]:
df.notnull().sum()

abc     6
name    7
roll    7
id      5
dtype: int64